*> 
*> PROGRAMA: CONSULTA.COB
*> PROCESSAR CONSULTA DE CLIENTE POR CODIGO (LINE SEQ)
*> 
PROGRAM-ID. consulta.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-CLIENTES ASSIGN TO "CLIENTES.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  ARQ-CLIENTES.
01  REG-ARQ-CLIENTE.
    05 ARQ-CODIGO    PIC X(09).
    05 ARQ-NOME      PIC X(30).
    05 ARQ-TELEFONE  PIC X(15).
    05 ARQ-EMAIL     PIC X(40).

WORKING-STORAGE SECTION.
01  SINALIZADORES.
    05 FIM-DO-ARQUIVO  PIC X(01) VALUE "N".

LINKAGE SECTION.
COPY "REGISTRO.cpy".

PROCEDURE DIVISION USING REGISTRO-CLIENTE.
MAIN-PROCEDURE.
    MOVE "N" TO FIM-DO-ARQUIVO
    MOVE "01" TO REG-STATUS
    
    MOVE SPACES TO REG-NOME
    MOVE SPACES TO REG-TELEFONE
    MOVE SPACES TO REG-EMAIL

    OPEN INPUT ARQ-CLIENTES
    
    PERFORM UNTIL FIM-DO-ARQUIVO = "S"
        READ ARQ-CLIENTES
            AT END
                MOVE "S" TO FIM-DO-ARQUIVO
            NOT AT END
                IF ARQ-CODIGO = REG-CODIGO
                    MOVE ARQ-NOME      TO REG-NOME
                    MOVE ARQ-TELEFONE  TO REG-TELEFONE
                    MOVE ARQ-EMAIL     TO REG-EMAIL
                    MOVE "00"          TO REG-STATUS
                    MOVE "S"           TO FIM-DO-ARQUIVO
                END-IF
        END-READ
    END-PERFORM

    CLOSE ARQ-CLIENTES
    EXIT PROGRAM.
    