        01  REGISTRO-CLIENTE.
            05 REG-CODIGO    PIC X(09).
            05 REG-NOME      PIC X(30).
            05 REG-TELEFONE  PIC X(15).
            05 REG-EMAIL     PIC X(40).
            05 REG-STATUS    PIC X(02).
            